In [1]:
# task 1
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
data = pd.DataFrame({
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female'],
    'Profession': ['Developer', 'Manager', 'CEO', 'Assistant Manager', 'Team Lead'],
    'Salary': [50000, 70000, 120000, 40000, 80000],
    'Experience': [2, 5, 15, 1, 7]
})

In [ ]:
data

   ID     Name  Gender         Profession  Salary  Experience
0   1    Alice  Female          Developer   50000           2
1   2      Bob    Male            Manager   70000           5
2   3  Charlie    Male                CEO  120000          15
3   4    David    Male  Assistant Manager   40000           1
4   5      Eva  Female          Team Lead   80000           7

In [4]:
data.shape

(5, 6)

In [5]:
data.drop(columns='Name', inplace=True)

In [6]:
data

   ID  Gender         Profession  Salary  Experience
0   1  Female          Developer   50000           2
1   2    Male            Manager   70000           5
2   3    Male                CEO  120000          15
3   4    Male  Assistant Manager   40000           1
4   5  Female          Team Lead   80000           7

In [8]:
# Task 2
from sklearn.preprocessing import OneHotEncoder, OrdinalEncoder
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import make_pipeline
data['Profession'].unique()

array(['Developer', 'Manager', 'CEO', 'Assistant Manager', 'Team Lead'],
      dtype=object)

In [11]:
onehot_pipe = make_pipeline(OneHotEncoder(sparse_output=False))
ordinal_pipe = make_pipeline(
    OrdinalEncoder(categories=[['Assistant Manager', 'Developer', 'Team Lead', 'Manager', 'CEO']])
)
transformer = ColumnTransformer(transformers=[
    ('gender_ohe', onehot_pipe, ['Gender']),
    ('profession_ord', ordinal_pipe, ['Profession'])
])

In [14]:
encoded_array = transformer.fit_transform(data)
encoded_df = pd.DataFrame(
    encoded_array,
    columns=transformer.get_feature_names_out()
)

In [15]:
encoded_df

,gender_ohe__Gender_Female,gender_ohe__Gender_Male,profession_ord__Profession
0,1.0,0.0,1.0
1,0.0,1.0,3.0
2,0.0,1.0,4.0
3,0.0,1.0,0.0
4,1.0,0.0,2.0

In [16]:
encoded_df.columns

Index(['gender_ohe__Gender_Female', 'gender_ohe__Gender_Male',
       'profession_ord__Profession'],
      dtype='object')

In [17]:
# Task 3
data

   ID  Gender         Profession  Salary  Experience
0   1  Female          Developer   50000           2
1   2    Male            Manager   70000           5
2   3    Male                CEO  120000          15
3   4    Male  Assistant Manager   40000           1
4   5  Female          Team Lead   80000           7

In [18]:
manual_numerics = ['ID', 'Salary', 'Experience']

In [ ]:
from sklearn.preprocessing import StandardScaler, MinMaxScaler, RobustScaler
scaler_std = StandardScaler()
scaler_minmax = MinMaxScaler()
scaler_robust = RobustScaler()

In [20]:
auto_numerics = data.select_dtypes(exclude='object').columns.tolist()

In [21]:
auto_numerics

['ID', 'Salary', 'Experience']

In [22]:
# Task 4
scaled_std = scaler_std.fit_transform(data[auto_numerics])
scaled_std_df = pd.DataFrame(scaled_std, columns=auto_numerics)
final_std_df = pd.concat([encoded_df, scaled_std_df], axis=1)

In [23]:
final_std_df

,gender_ohe__Gender_Female,gender_ohe__Gender_Male,profession_ord__Profession,ID,Salary,Experience
0,1.0,0.0,1.0,-1.414214,-0.789754,-0.803219
1,0.0,1.0,3.0,-0.707107,-0.071796,-0.200805
2,0.0,1.0,4.0,0.000000,1.723100,1.807243
3,0.0,1.0,0.0,0.707107,-1.148733,-1.004024
4,1.0,0.0,2.0,1.414214,0.287183,0.200805

In [24]:
# Task 5
scaled_minmax = scaler_minmax.fit_transform(data[auto_numerics])
scaled_minmax_df = pd.DataFrame(scaled_minmax, columns=auto_numerics)
scaled_minmax_df

     ID  Salary  Experience
0  0.00   0.125    0.071429
1  0.25   0.375    0.285714
2  0.50   1.000    1.000000
3  0.75   0.000    0.000000
4  1.00   0.500    0.428571

In [26]:
# Task 6
scaled_robust = scaler_robust.fit_transform(data[auto_numerics])
scaled_robust_df = pd.DataFrame(scaled_robust, columns=auto_numerics)
scaled_robust_df

    ID    Salary  Experience
0 -1.0 -0.666667        -0.6
1 -0.5  0.000000         0.0
2  0.0  1.666667         2.0
3  0.5 -1.000000        -0.8
4  1.0  0.333333         0.4